In [11]:
import numpy as np
import pandas as pd

In [13]:
df =pd.read_csv('spam.csv',encoding="ISO-8859-1")

In [14]:
df.sample(5)

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
411,ham,Cos i want it to be your thing,NaN,NaN,NaN
2977,ham,Yar lor... Keep raining non stop... Or u wan 2...,NaN,NaN,NaN
4380,ham,Mathews or tait or edwards or anderson,NaN,NaN,NaN
36,ham,"Oops, I'll let you know when my roommate's done",NaN,NaN,NaN
475,ham,Ok I'm gonna head up to usf in like fifteen mi...,NaN,NaN,NaN

In [16]:
df.shape

(5572, 5)

## 1. Data Cleaning

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5572 entries, 0 to 5571
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   v1          5572 non-null   object
 1   v2          5572 non-null   object
 2   Unnamed: 2  50 non-null     object
 3   Unnamed: 3  12 non-null     object
 4   Unnamed: 4  6 non-null      object
dtypes: object(5)
memory usage: 217.8+ KB

In [20]:
#drop last 3 columns
df.drop(columns=['Unnamed: 2','Unnamed: 3','Unnamed: 4'], inplace=True)

In [21]:
df.sample(5)

       v1                                                 v2
1563  ham     Get ready to put on your excellent sub face :)
3769  ham  Love it! The girls at the office may wonder wh...
3849  ham  I to am looking forward to all the sex cuddlin...
5515  ham  You are a great role model. You are giving so ...
5341  ham             And of course you should make a stink!

In [22]:
df.rename(columns={'v1':'target','v2':'text'},inplace=True)

In [23]:
df.sample(5)

     target                                               text
618     ham  I come n pick Ì_ up... Come out immediately af...
4797    ham     Just come home. I don't want u to be miserable
602     ham             Speaking of does he have any cash yet?
5301    ham                At WHAT TIME should i come tomorrow
5129    ham  Rose for red,red for blood,blood for heart,hea...

In [24]:
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()

In [27]:
df['target']= encoder.fit_transform(df['target'])

In [28]:
df.sample(5)

      target                                               text
2704       1  FreeMsg: Fancy a flirt? Reply DATE now & join ...
1439       0  In fact when do you leave? I think addie goes ...
3651       0     Probably not, still going over some stuff here
3493       1  You are being contacted by our dating service ...
1274       0  Let me know how to contact you. I've you settl...

In [32]:
#missing value
df.isnull().sum()

target    0
text      0
dtype: int64

In [34]:
#check for duplication
df.duplicated().sum()

403

In [40]:
df = df.drop_duplicates(keep='first')

In [41]:
df.duplicated().sum()

0

In [43]:
df.shape

(5169, 2)

## 2. EDA